{"body":"Coral Reef Studies and Products        Recent Kaloko Pond reconstruction. NPS photo.       The park\u0027s recent marine and freshwater reports include, in part: Ball, F. 1977. Benthic marine algae of the coastal waters of Puukohola Heiau National Historic Site. Tech. Report #16, Coop. National Park Resources Study Unit, Dept. of Botany, Univ. of Hawai`i , Honolulu, Hawai`i . 12 pp. Brasher, A. 1996. Ichthyological survey of selected ponds on the Island of Hawai`i . Brasher, A. 1999. Development of a monitoring program to assess physical, chemical and biological components of Kaloko Fishpond at Kaloko-Honokohau National Historical Park on the Island of Hawai`i . Cheney, D., D. Hemmes and R. Nolan. 1977. Physiography and marine fauna of inshore and intertidal areas in Puukohala Heiau National Historic Site. Tech. Report #13, Coop. National Park Resources Study Unit, Dept. of Botany, Univ. of Hawai`i , Honolulu, Hawai`i . 36 pp. Doty, M. 1969. The ecology of Honaunau Bay, Hawai`i . University of Hawai`i , Hawai`i Botanical Science Paper No. 14. Ludwig, G.M., L.R. Taylor, Jr., and D.M. Imose. 1980. Summer census of the reef-fish community of waters adjacent to Pu\u0027uhonua o Honaunau National Historic Park Summers 1974-1978. Honolulu, Cooperative National Park Resources Studies Unit University of Hawaii at Manoa: 46. Parrish, J., G. Smith, and J. Norris. 1990. Resources of the marine waters of Kaloko-Honokohau National Historical Park.  University of Hawai`i Cooperative Ecosystem Technical Report 74. Peterson, John A. and Maria Ka’imopono Orr.  2005.  I ‘Ono Ke Kole, I’a Ono Ke Kole – Sweet Conversation, Sweet-Tasting Fish:  A Marine Ethnography of Kaloko-Honokohau National Historical Park, Kailua-Kona, Hawaii.   International Archaeological Research Institute, Inc., Honolulu.  Final report prepared for National Park Service.  NPS Contract No. C8298030001","url":"https://www.nps.gov/kaho/learn/nature/coralreefstud.htm","title":"Kaloko-Honokōhau National Historical Park: Coral Reef Studies and Products"}