{"body":"Support Your Park       There are many ways to get involved and support Tallgrass Prairie National Preserve. The preserve offers many rewarding experiences and opportunities in how you may contribute. Interesting discoveries are within your reach when you get involved through volunteering or giving in other ways. The preserve gains from your expertise and talents. Opportunities can be found as an individual or through group efforts. Whether it is providing citizen science through butterfly counts, giving interpretive tours and programs, hands on labor such as fence repair or litter pick-up, maintaining trails, reducing the impacts on the environment through recycling or other means of support and donation, volunteer prospects abound. Your efforts give additional value for other visitors to experience. In return, you get the satisfaction of knowing that your contributions assist in the protection and conservation of the natural, cultural and historical resources of Tallgrass Prairie National Preserve. Examples of some of the opportunities are listed below:           Volunteers preparing to collect prairie seeds with direction from Dr. Tom Eddy   Summer Natural Resource Volunteer Opportunities Prairie Seed Harvesting - Help the staff harvest prairie seeds after a short training session.Please call ahead (620-273-8494) to verify program availability due to staffing constraints.  The seeds collected will be used to restore bottomland prairie areas at the preserve. Volunteers should wear appropriate clothing, wear sturdy shoes and sun hat, bring drinking water, and use bug spray. Training will be provided by the staff before the activity begins.        Boyscout troop working on the Southwind Nature Trail NPS Photo  Trail Workers Always Needed The preserve is always in need of assistance on various projects, especially with over 40 miles of trails to maintain. Please call ahead (620-273-8494) to see how you may assist and make a difference.        Greater prairie chicken at the preserve NPS Photo  Volunteer Birders Needed with Bird Monitoring on the Preserve Tallgrass Prairie National Preserve and the Heartland Network Inventory and Monitoring Program of the National Park Service are seeking the assistance of volunteer birders to augment an ongoing region wide bird monitoring program.  Volunteer birders will apply standard monitoring techniques to determine the annual distribution and abundance of breeding birds on the preserve.  Volunteers will work closely with the parks Natural Resource Staff and the Heartland Networks project supervisor in this bird  monitoring effort. Please contact David Peitz, Wildlife Ecologist (417) 732-6438 ext. 276 for questions specific to bird monitoring  Kristen Hase, Chief of Natural Resources (620) 273-6034  Eric Patterson, Volunteer Coordinator (620) 273-8494","url":"https://www.nps.gov/tapr/getinvolved/supportyourpark/index.htm","title":"Tallgrass Prairie National Preserve: Support Your Park"}