{"body":"Planning       On November 12, 1996, legislation was passed creating Tallgrass Prairie National Preserve in the Flint Hills region of Kansas. A superintendent was assigned to the site in February 1997. A General Management Plan (GMP) for the site was finalized on December 6, 2000, when the Acting Regional Director signed the Record of Decision.  The preserve protects a nationally significant example of the once vast tallgrass ecosystem. Of the 170 million acres of tallgrass prairie that once covered the North American continent, less than 4 percent remains, primarily in the Flint Hills of Kansas. Tallgrass Prairie National Preserve is a new kind of national park. The preserve encompasses 10,894 acres, but most of that land will remain under the ownership of The Nature Conservancy, which purchased the land in 2005. The property was originally purchased by the National Park Trust in 1994. The National Park Service may own up to 180 acres, yet the legislation calls for the entire acreage to be managed cooperatively by the National Park Service and the private land owner. On September 20, 2002, approximately 32 acres were donated to the National Park Service from the National Park Trust. This area includes the 1881 historic ranch house, limestone barn and outbuildings, and one-room schoolhouse. The General Management Plan may be downloaded via pdf sections. Section 1 (284 KB) Section 2 (2.35 MB) Section 3 (1.34 MB) Section 4 (70 KB) Section 5 (3.6 MB) Appendices (138 KB) Bibliography (37 KB) List of Preparers (8 KB) Further Planning Documents and Historical References General Management Plan Revision/Site Development Study (56 MB) Strategic Plan for the future (48 KB)  Annual Performance Plan 2011 (74 KB)  Annual Performance Report 2011 (37 KB)  Legislative History 1920 - 1996 (follow the link - Large file size) It\u0027s the 3rd link from the top. Bison Management Plan Environmental Assessment (1.4 MB) Scope of Collections Statement (2,188 KB) Historic Structures Report 2005  (follow the link - Large file size) It\u0027s the 9th link from the top. Cultural Landscape Report 2004  (follow the link - Large file size) It\u0027s the 7th link from the top.","url":"https://www.nps.gov/tapr/getinvolved/planning.htm","title":"Tallgrass Prairie National Preserve: Planning"}